<?php
class Model_Order_Payment_Allpay_Returncode_Atm {
    //授權碼
    static $code = array(
        '1' => '交易成功',
        '2' => '取號成功',
        '10000051' => '操作錯誤',
        '10100001' => 'IP 拒絕存取',
        '10100002' => '交易發生錯誤',
        '10100050' => '參數錯誤',
        '10100051' => 'XML參數或格式錯誤',
        '10100052' => '特店編號錯誤',
        '10100053' => '特店狀態錯誤',
        '10100054' => '廠商交易序號重複',
        '10100055' => '新增交易失敗',
        '10100056' => '交易編號有誤',
        '10100057' => '找不到加密金鑰，請確認是否有申請開通此付款方式',
        '10100058' => '付款失敗',
        '10100059' => '找不到交易序號',
        '10200019' => '商品編號錯誤',
        '10200038' => '特店交易序號錯誤',
        '10200039' => '交易金額錯誤',
        '10200040' => '序號錯誤',
        '10200041' => '更新商品明細失敗',
        '10200042' => '更新序號狀態失敗',
        '10100200' => '資料解密失敗，請確認資料是否正確方式加密',
        '10200089' => 'IP位址已阻擋',
    );
}
